import { Table } from 'react-bootstrap'

export const RiskPlanning = () => {
    var solutions = new Array(46);
    for(var i = 0; i < solutions.length; ++i)
        solutions[i] = 
        <td>
            <select>
                <option value="s_0"></option>
                <option value="s_1">ev1.попереднє навчання членів проектного колективу</option>
                <option value="s_2">ev2.узгодження детального переліку вимог до ПЗ із замовником</option>
                <option value="s_3">ev3.внесення узгодженого переліку вимог до ПЗ замовника в договір</option>
                <option value="s_4">ev4.точне слідування вимогам замовника з узгодженого переліку вимог до ПЗ</option>
                <option value="s_5">ev5.попередні дослідження ринку</option>
                <option value="s_6">ev6.експертна оцінка програмного проекту досвідченим стороннім консультантом</option>
                <option value="s_7">ev7.консультації досвідченого стороннього консультанта</option>
                <option value="s_8">ev8.тренінг з вивчення необхідних інструментів розроблення ПЗ</option>
                <option value="s_9">ev9.укладання договору страхування</option>
                <option value="s_10">ev10.використання "шаблонних" рішень з вдалих попередніх проектів при управлінні програмним проектом</option>
                <option value="s_11">ev11.підготовка документів, які показують важливість даного проекту для досягнення фінансових цілей компанії-розробника</option>
                <option value="s_12">ev12.реорганізація роботи проектного колективу так, щоб обов'язки та робота членів колективу перекривали один одного</option>
                <option value="s_13">ev13.придбання (замовлення) частини компонент розроблюваного ПЗ</option>
                <option value="s_14">ev14.заміна потенційно дефектних компонент розроблюваного ПЗ придбаними компонентами, які гарантують якість виконання роботи</option>
                <option value="s_15">ev15.придбання більш продуктивної бази даних</option>
                <option value="s_16">ev16.використання генератора програмного коду</option>
                <option value="s_17">ev17.реорганізація роботи проектного колективу залежно від рівня труднощів виконання завдань та професійних рівнів розробників</option>
                <option value="s_18">ev18.повторне використання придатних компонент ПЗ, які були розроблені для інших програмних проектів</option>
                <option value="s_19">ev19.аналіз доцільності розроблення даного ПЗ</option>
            </select>
        </td>

    return(
        <div>
            <h1 className='text-danger'>Планування ризиків</h1>
            <Table striped bordered hover>
                <thead>
                    <tr>
                        <th>Ризикові події</th>
                        <th>Можливі рішення</th>
                    </tr>
                </thead>
                <tbody>
                    <tr>
                        <td>
                            t1.Затримки у постачанні обладнання, необхідного для підтримки процесу розроблення ПЗ
                        </td>
                        {solutions[0]}
                    </tr>
                    <tr>
                        <td>
                            t2.Затримки у постачанні інструментальних засобів, необхідних для підтримки процесу розроблення ПЗ
                        </td>
                        {solutions[1]}
                    </tr>    
                    <tr>
                        <td>
                            t3.Небажання команди виконавців ПЗ використовувати інструментальні засоби для підтримки процесу розроблення ПЗ
                        </td>
                        {solutions[2]}
                    </tr>
                    <tr>
                        <td>
                            t4.Відмова команди виконавців від CASE-засобів розроблення ПЗ
                        </td>
                        {solutions[3]}
                    </tr>
                    <tr>
                        <td>
                            t5.Формування запитів на більш потужні інструментальні засоби розроблення ПЗ
                        </td>
                        {solutions[4]}
                    </tr>
                    <tr>
                        <td>
                            t6.Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ
                        </td>
                        {solutions[5]}
                    </tr>
                    <tr>
                        <td>
                            t7.Програмні компоненти, які використовують повторно в ПЗ, мають дефекти та обмежені функціональні можливості
                        </td>
                        {solutions[6]}
                    </tr>
                    <tr>
                        <td>
                            t8.Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ
                        </td>
                        {solutions[7]}
                    </tr>
                    <tr>
                        <td>
                            t9.Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ
                        </td>
                        {solutions[8]}
                    </tr>
                    <tr>
                        <td>
                            t10.Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів
                        </td>
                        {solutions[9]}
                    </tr>
                    <tr>
                        <td>
                            t11.Поява дефектних системних комопнент, які використовують для розроблення ПЗ
                        </td>
                        {solutions[10]}
                    </tr>

                    <tr>
                        <td>
                            c1.Недооцінювання витрат на реалізацію програмного продукту (надмірно низька вартість)
                        </td>
                        {solutions[11]}
                    </tr>
                    <tr>
                        <td>
                            c2.Переоцінювання витрат на реалізацію програмного продукту (надмірно висока вартість)
                        </td>
                        {solutions[12]}
                    </tr>
                    <tr>
                        <td>
                            c3.Фінансові ускладнення у компанії-замовника ПЗ
                        </td>
                        {solutions[13]}
                    </tr>
                    <tr>
                        <td>
                            c4.Фінансові ускладнення у компанії-розробника ПЗ
                        </td>
                        {solutions[14]}
                    </tr>
                    <tr>
                        <td>
                            c5.Збільшення бюджету програмного проекту з ініціативи компанії-розробника ПЗ під час його реалізації
                        </td>
                        {solutions[15]}
                    </tr>
                    <tr>
                        <td>
                            c6.Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ
                        </td>
                        {solutions[16]}
                    </tr>
                    <tr>
                        <td>
                            c7.Реорганізація структурних підрозділів у компанії-замовника ПЗ
                        </td>
                        {solutions[17]}
                    </tr>
                    <tr>
                        <td>
                            c8.Реорганізація команди виконавців у компанії-розробника ПЗ
                        </td>
                        {solutions[18]}
                    </tr>

                    <tr>
                        <td>
                            p1.Зміни графіку виконання робіт з боку замовника чи виконавця
                        </td>
                        {solutions[19]}
                    </tr>
                    <tr>
                        <td>
                            p2.Порушення графіку виконання робіт у компанії-розробника ПЗ
                        </td>
                        {solutions[20]}
                    </tr>
                    <tr>
                        <td>
                            p3.Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ
                        </td>
                        {solutions[21]}
                    </tr>
                    <tr>
                        <td>
                            p4.Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ
                        </td>
                        {solutions[22]}
                    </tr>
                    <tr>
                        <td>
                            p5.Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ
                        </td>
                        {solutions[23]}
                    </tr>
                    <tr>
                        <td>
                            p6.Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-замовника ПЗ
                        </td>
                        {solutions[24]}
                    </tr>
                    <tr>
                        <td>
                            p7.Переоцінювання тривалості етапів реалізації програмного проекту
                        </td>
                        {solutions[25]}
                    </tr>
                    <tr>
                        <td>
                            p8.Остаточний розмір ПЗ перевищує заплановані його характеристики
                        </td>
                        {solutions[26]}
                    </tr>
                    <tr>
                        <td>
                            p9.Остаточний розмір ПЗ значно менший за заплановані його характеристики
                        </td>
                        {solutions[27]}
                    </tr>
                    <tr>
                        <td>
                            p10.Поява на ринку аналогічного ПЗ до виходу замовленого
                        </td>
                        {solutions[28]}
                    </tr>
                    <tr>
                        <td>
                            p11.Поява на ринку більше конкурентоздатного ПЗ
                        </td>
                        {solutions[29]}
                    </tr>

                    <tr>
                        <td>
                            m1.Низький моральний стан персоналу команди виконавців ПЗ
                        </td>
                        {solutions[30]}
                    </tr>
                    <tr>
                        <td>
                            m2.Низька взаємодія між членами команди виконавців ПЗ
                        </td>
                        {solutions[31]}
                    </tr>
                    <tr>
                        <td>
                            m3.Пасивність керівника(менеджера) програмного проекту
                        </td>
                        {solutions[32]}
                    </tr>
                    <tr>
                        <td>
                            m4.Недостатня компетентність керівника(менеджера) програмного проекту
                        </td>
                        {solutions[33]}
                    </tr>
                    <tr>
                        <td>
                            m5.Незадоволеність замовника результатами етапів реалізації програмного проекту
                        </td>
                        {solutions[34]}
                    </tr>
                    <tr>
                        <td>
                            m6.Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем
                        </td>
                        {solutions[35]}
                    </tr>
                    <tr>
                        <td>
                            m7.Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ
                        </td>
                        {solutions[36]}
                    </tr>
                    <tr>
                        <td>
                            m8.Одночасна хвороба декількох виконавців під час розроблення ПЗ
                        </td>
                        {solutions[37]}
                    </tr>
                    <tr>
                        <td>
                            m9.Неможливість організації необхідного навчання персоналу команди виконавців ПЗ
                        </td>
                        {solutions[38]}
                    </tr>
                    <tr>
                        <td>
                            m10.Зміна пріоритетів у процесі управління програмним проектом
                        </td>
                        {solutions[39]}
                    </tr>
                    <tr>
                        <td>
                            m11.Недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ
                        </td>
                        {solutions[40]}
                    </tr>
                    <tr>
                        <td>
                            m12.Переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ
                        </td>
                        {solutions[41]}
                    </tr>
                    <tr>
                        <td>
                            m13.Надмірне документування результатів на етапах реалізації програмного проекту
                        </td>
                        {solutions[42]}
                    </tr>
                    <tr>
                        <td>
                            m14.Недостатнє документування результатів на етапах реалізації програмного проекту
                        </td>
                        {solutions[43]}
                    </tr>
                    <tr>
                        <td>
                            m15.Нереалістичне прогнозування результатів на етапах реалізації програмного проекту
                        </td>
                        {solutions[44]}
                    </tr>
                    <tr>
                        <td>
                            m16.Недостатній професійний рівень представників від компанії-замовника ПЗ
                        </td>
                        {solutions[45]}
                    </tr>
                </tbody>
            </Table>
        </div>
    )
}